* Among Nurse

** Understanding the table

- iter(fix)/C shows the total # of iteration per choice point.
- #CS is the number of times createState is called.
- #L number of layers
- nbNode total number of nodes in MDD
- CS/N  number of calls to createState normalized by  number of MDD
  nodes.
- Choice-Rate: reduction rate in choice point w.r.t.   previous width.
- CS-Rate: reduction rate calls to createState  w.r.t. previous width
- CS/N-Rate: reduction rate in createState/Node w.r.t. previous width.

** Data
This is the best model (seqMDD3). Bi-directional.
- State takes 224 bytes
- Properties are still bytes
- States uses 172 properties

|   w | m | choice |   fail | #iter(fix)/C |      #CS | #L | time | nbNode |    #CS/#N | Choice-Rate | CS-Rate | CS/N-Rate |
|-----+---+--------+--------+--------------+----------+----+------+--------+-----------+-------------+---------+-----------|
|   1 | 3 | 375140 | 185287 |         1.55 | 12356839 | 40 | 18.1 |     40 | 308920.98 |             |         |           |
|   2 | 3 | 163392 |  79413 |          1.9 | 16358330 | 40 | 24.1 |     80 | 204479.13 |        2.30 |    0.76 |      1.51 |
|   4 | 3 |  52568 |  24001 |          2.8 | 13207178 | 40 | 18.8 |    160 |  82544.86 |        3.11 |    1.24 |      2.48 |
|   8 | 3 |  22274 |   8854 |          3.1 | 10269173 | 40 | 14.7 |    320 |  32091.17 |        2.36 |    1.29 |      2.57 |
|  16 | 3 |   8806 |   2120 |         3.27 |  7005305 | 40 | 10.1 |    640 |  10945.79 |        2.53 |    1.47 |      2.93 |
|  32 | 3 |   6456 |    945 |          3.1 |  6166040 | 40 |  9.0 |   1280 |   4817.22 |        1.36 |    1.14 |      2.27 |
|  64 | 3 |   5146 |    299 |         2.96 |  4999621 | 40 |  7.2 |   2560 |   1952.98 |        1.25 |    1.23 |      2.47 |
| 128 | 3 |   4738 |     86 |         2.88 |  4700471 | 40 |  7.3 |   5120 |    918.06 |        1.09 |    1.06 |      2.13 |
#+TBLFM: $9=$1*$7::$10=$6/$9;%0.2f
#+TBLFM: @3$11=@2$3/$3;%0.2f::@4$11=@3$3/$3;%0.2f::@5$11=@4$3/$3;%0.2f::@6$11=@5$3/$3;%0.2f::@7$11=@6$3/$3;%0.2f::@8$11=@7$3/$3;%0.2f::@9$11=@8$3/$3;%0.2f
#+TBLFM: @3$12=@2$6/$6;%0.2f::@4$12=@3$6/$6;%0.2f::@5$12=@4$6/$6;%0.2f::@6$12=@5$6/$6;%0.2f::@7$12=@6$6/$6;%0.2f::@8$12=@7$6/$6;%0.2f::@9$12=@8$6/$6;%0.2f
#+TBLFM: @3$13=@2$10/$10;%0.2f::@4$13=@3$10/$10;%0.2f::@5$13=@4$10/$10;%0.2f::@6$13=@5$10/$10;%0.2f::@7$13=@6$10/$10;%0.2f::@8$13=@7$10/$10;%0.2f::@9$13=@8$10/$10;%0.2f

This is a pure top-down model (no up information) 
- State takes 592 bytes
- Properties are all integers (fast)
- State uses 146 properties

|   w | m | choice |   fail | #iter(fix)/C |     #CS | #L | time | nbNode |    #CS/#N | Choice-Rate | CS-Rate | CS/N-Rate |
|-----+---+--------+--------+--------------+---------+----+------+--------+-----------+-------------+---------+-----------|
|   1 | 1 | 375140 | 185287 |      1.05137 | 4777581 | 40 |  5.0 |     40 | 119439.53 |             |         |           |
|   2 | 1 | 190120 |  92777 |      1.14861 | 7915365 | 40 |  6.7 |     80 |  98942.06 |        1.97 |    0.60 |      1.21 |
|   4 | 1 |  67080 |  31257 |       1.3823 | 7282379 | 40 |  6.1 |    160 |  45514.87 |        2.83 |    1.09 |      2.17 |
|   8 | 1 |  34506 |  14970 |      1.26905 | 5586608 | 40 |  4.9 |    320 |  17458.15 |        1.94 |    1.30 |      2.61 |
|  16 | 1 |  17046 |   6240 |      1.35193 | 4829054 | 40 |  4.2 |    640 |   7545.40 |        2.02 |    1.16 |      2.31 |
|  32 | 1 |  10404 |   2919 |      1.40677 | 3555647 | 40 |  3.1 |   1280 |   2777.85 |        1.64 |    1.36 |      2.72 |
|  64 | 1 |  13194 |   4314 |      1.32901 | 5962597 | 40 |  5.0 |   2560 |   2329.14 |        0.79 |    0.60 |      1.19 |
| 128 | 1 |   7888 |   1661 |      1.44929 | 3436506 | 40 |  3.6 |   5120 |    671.19 |        1.67 |    1.74 |      3.47 |
#+TBLFM: $9=$1*$7::$10=$6/$9;%0.2f
#+TBLFM: @3$11=@2$3/$3;%0.2f::@4$11=@3$3/$3;%0.2f::@5$11=@4$3/$3;%0.2f::@6$11=@5$3/$3;%0.2f::@7$11=@6$3/$3;%0.2f::@8$11=@7$3/$3;%0.2f::@9$11=@8$3/$3;%0.2f
#+TBLFM: @3$12=@2$6/$6;%0.2f::@4$12=@3$6/$6;%0.2f::@5$12=@4$6/$6;%0.2f::@6$12=@5$6/$6;%0.2f::@7$12=@6$6/$6;%0.2f::@8$12=@7$6/$6;%0.2f::@9$12=@8$6/$6;%0.2f
#+TBLFM: @3$13=@2$10/$10;%0.2f::@4$13=@3$10/$10;%0.2f::@5$13=@4$10/$10;%0.2f::@6$13=@5$10/$10;%0.2f::@7$13=@6$10/$10;%0.2f::@8$13=@7$10/$10;%0.2f::@9$13=@8$10/$10;%0.2f

** Analysis

A few observations on m3
- The number of choice points drops at a factor > 2 up to with 16,
  then it slows down
- The number of ~createState~ calls increases at first, despite the more
  than halving of the number of choice point. So that is a net loss
  (since ~createState~ is the most expensive operation at the moment)
- The number of ~createState~ per mdd node does drop at a rate > 2,
  except going from w=1 to w=2 where the drop is more modest (1.51)
- The CS-Rate starts below 1 (i.e.,  going w=1->2 has a net
  increase). That observation is even _worse_ with m=1 where the rate
  is 0.6.

Comparison to m1
- This hurts. The number of calls to ~createState~ is almost 3 times higher
  in m3 while at width=1, i.e.,  4.7M versus 12.3M. I can understand
  doubling, because of the up-pass. But the almost triple hurts. 
- The number of fixpoint iteration per choice explains the above. 1.05
  in m1 vs. 1.55 in m3. 

Lessons ?
- Sounds like bounding the number of fixpoint iterations is in order. 
- There are too many calls to create state at the onset with w=2. It's
  true for both m=1 and m=3. Recall that we start with an mdd of
  width=1 and use the post to do an initial round of splitting to
  bring it to the desired width. Maybe we should revisit that. This
  was motivated by the up-pass that was required to do any kind of
  initial filtering of arcs. 


** Refinement 

Ok, I merely bounded the number of iterations of fixpoint to 2.

|   w | m | choice |   fail | #iter(fix)/C |      #CS | #L | time | nbNode |    #CS/#N | Choice-Rate | CS-Rate | CS/N-Rate |
|-----+---+--------+--------+--------------+----------+----+------+--------+-----------+-------------+---------+-----------|
|   1 | 3 | 375140 | 185287 |         1.55 | 12356839 | 40 | 18.1 |     40 | 308920.98 |             |         |           |
|   2 | 3 | 177484 |  86459 |         0.71 | 12347491 | 40 | 17.2 |     80 | 154343.64 |        2.11 |    1.00 |      2.00 |
|   4 | 3 |  74582 |  35008 |         0.84 | 10226362 | 40 | 13.6 |    160 |  63914.76 |        2.38 |    1.21 |      2.41 |
|   8 | 3 |  32216 |  13825 |         0.96 |  7366953 | 40 |  9.9 |    320 |  23021.73 |        2.32 |    1.39 |      2.78 |
|  16 | 3 |  15210 |   5322 |         1.07 |  5413852 | 40 |  7.4 |    640 |   8459.14 |        2.12 |    1.36 |      2.72 |
|  32 | 3 |   8874 |   2154 |         1.26 |  4070803 | 40 |  5.9 |   1280 |   3180.31 |        1.71 |    1.33 |      2.66 |
|  64 | 3 |   5896 |    665 |         1.50 |  2986129 | 40 |  4.4 |   2560 |   1166.46 |        1.51 |    1.36 |      2.73 |
| 128 | 3 |   5432 |    433 |         1.56 |  3025268 | 40 |  5.2 |   5120 |    590.87 |        1.09 |    0.99 |      1.97 |
#+TBLFM: $9=$1*$7::$10=$6/$9;%0.2f
#+TBLFM: @3$11=@2$3/$3;%0.2f::@4$11=@3$3/$3;%0.2f::@5$11=@4$3/$3;%0.2f::@6$11=@5$3/$3;%0.2f::@7$11=@6$3/$3;%0.2f::@8$11=@7$3/$3;%0.2f::@9$11=@8$3/$3;%0.2f
#+TBLFM: @3$12=@2$6/$6;%0.2f::@4$12=@3$6/$6;%0.2f::@5$12=@4$6/$6;%0.2f::@6$12=@5$6/$6;%0.2f::@7$12=@6$6/$6;%0.2f::@8$12=@7$6/$6;%0.2f::@9$12=@8$6/$6;%0.2f
#+TBLFM: @3$13=@2$10/$10;%0.2f::@4$13=@3$10/$10;%0.2f::@5$13=@4$10/$10;%0.2f::@6$13=@5$10/$10;%0.2f::@7$13=@6$10/$10;%0.2f::@8$13=@7$10/$10;%0.2f::@9$13=@8$10/$10;%0.2f

This is another improvement to support the ordering discussed on the
parent. It has a dramatic effect on the choices/failures. That makes
createState stick out even more.

|  w | m | choice |   fail | #iter(fix)/C |      #CS | #L | time | nbNode |    #CS/#N | Choice-Rate | CS-Rate | CS/N-Rate |
|----+---+--------+--------+--------------+----------+----+------+--------+-----------+-------------+---------+-----------|
|  1 | 3 | 375140 | 185287 |         1.55 | 12356839 | 40 | 18.3 |     40 | 308920.98 |             |         |           |
|  2 | 3 |   5100 |    267 |         2.67 |  5085097 | 40 |  5.2 |     80 |  63563.71 |       73.56 |    2.43 |      4.86 |
|  4 | 3 |   5224 |    329 |         2.61 |  5290798 | 40 |  4.9 |    160 |  33067.49 |        0.98 |    0.96 |      1.92 |
|  8 | 3 |   4832 |    133 |         2.68 |  6905642 | 40 |  7.2 |    320 |  21580.13 |        1.08 |    0.77 |      1.53 |
| 16 | 3 |   4738 |     86 |         2.70 |  9919989 | 40 | 10.9 |    640 |  15499.98 |        1.02 |    0.70 |      1.39 |
| 32 | 3 |   4668 |     51 |         2.71 | 18614374 | 40 | 18.9 |   1280 |  14542.48 |        1.01 |    0.53 |      1.07 |
| 64 | 3 |   4606 |     20 |         2.73 | 52552898 | 40 | 49.6 |   2560 |  20528.48 |        1.01 |    0.35 |      0.71 |
#+TBLFM: $9=$1*$7::$10=$6/$9;%0.2f
#+TBLFM: @3$11=@2$3/$3;%0.2f::@4$11=@3$3/$3;%0.2f::@5$11=@4$3/$3;%0.2f::@6$11=@5$3/$3;%0.2f::@7$11=@6$3/$3;%0.2f::@8$11=@7$3/$3;%0.2f
#+TBLFM: @3$12=@2$6/$6;%0.2f::@4$12=@3$6/$6;%0.2f::@5$12=@4$6/$6;%0.2f::@6$12=@5$6/$6;%0.2f::@7$12=@6$6/$6;%0.2f::@8$12=@7$6/$6;%0.2f
#+TBLFM: @3$13=@2$10/$10;%0.2f::@4$13=@3$10/$10;%0.2f::@5$13=@4$10/$10;%0.2f::@6$13=@5$10/$10;%0.2f::@7$13=@6$10/$10;%0.2f::@8$13=@7$10/$10;%0.2f

|  w | m | choice |   fail | #iter(fix)/C |      #CS | #L | time | nbNode |    #CS/#N | Choice-Rate | CS-Rate | CS/N-Rate |
|----+---+--------+--------+--------------+----------+----+------+--------+-----------+-------------+---------+-----------|
|  1 | 1 | 375140 | 185287 |      1.05137 |  4777581 | 40 |  5.3 |     40 | 119439.53 |             |         |           |
|  2 | 1 |   5112 |    273 |      1.66451 |  4270495 | 40 |  4.1 |     80 |  53381.19 |       73.38 |    1.12 |      2.24 |
|  4 | 1 |   5204 |    319 |      1.63816 |  4520689 | 40 |  3.8 |    160 |  28254.31 |        0.98 |    0.94 |      1.89 |
|  8 | 1 |   4864 |    149 |      1.66283 |  5734575 | 40 |  4.9 |    320 |  17920.55 |        1.07 |    0.79 |      1.58 |
| 16 | 1 |   4732 |     83 |      1.67392 |  8369057 | 40 |  7.6 |    640 |  13076.65 |        1.03 |    0.69 |      1.37 |
| 32 | 1 |   4658 |     46 |      1.68463 | 13534043 | 40 | 13.2 |   1280 |  10573.47 |        1.02 |    0.62 |      1.24 |
| 64 | 1 |   4614 |     24 |      1.69072 | 23265798 | 40 | 23.9 |   2560 |   9088.20 |        1.01 |    0.58 |      1.16 |
#+TBLFM: $9=$1*$7::$10=$6/$9;%0.2f
#+TBLFM: @3$11=@2$3/$3;%0.2f::@4$11=@3$3/$3;%0.2f::@5$11=@4$3/$3;%0.2f::@6$11=@5$3/$3;%0.2f::@7$11=@6$3/$3;%0.2f::@8$11=@7$3/$3;%0.2f
#+TBLFM: @3$12=@2$6/$6;%0.2f::@4$12=@3$6/$6;%0.2f::@5$12=@4$6/$6;%0.2f::@6$12=@5$6/$6;%0.2f::@7$12=@6$6/$6;%0.2f::@8$12=@7$6/$6;%0.2f
#+TBLFM: @3$13=@2$10/$10;%0.2f::@4$13=@3$10/$10;%0.2f::@5$13=@4$10/$10;%0.2f::@6$13=@5$10/$10;%0.2f::@7$13=@6$10/$10;%0.2f::@8$13=@7$10/$10;%0.2f


#+BEGIN_SRC emacs-lisp :exports results :results table
  (org-table-import (expand-file-name "/tmp/saved.csv") nil)
#+END_SRC

** Among4Relax
| m |    w |   nodes |  fails |    iter |    nbCS | layers |   time |
|---+------+---------+--------+---------+---------+--------+--------|
| 1 |    1 | 1586528 | 793240 | 1586529 | 2020406 |     50 | 13.792 |
| 1 |    2 |     102 |     27 |     103 | 1200842 |     50 |  0.585 |
| 1 |    4 |   35544 |  17748 |   35545 | 2850609 |     50 |  1.748 |
| 1 |    8 |    4026 |   1989 |    4027 | 1940347 |     50 |  0.837 |
| 1 |   16 |    5098 |   2525 |    5099 | 1718405 |     50 |  0.846 |
| 1 |   32 |     226 |     89 |     227 |  799430 |     50 |   0.48 |
| 1 |   64 |      48 |      0 |      49 |  956557 |     50 |  0.842 |
| 1 |  128 |      48 |      0 |      49 | 1722748 |     50 |  1.768 |
| 1 |  256 |      48 |      0 |      49 | 2531680 |     50 |  3.691 |
| 1 |  512 |      48 |      0 |      49 | 2847375 |     50 |   6.53 |
| 1 | 1024 |      48 |      0 |      49 | 2731703 |     50 | 11.216 |
| 1 | 2048 |      48 |      0 |      49 | 1427112 |     50 |  5.017 |



** Among Nurse
| m |  w |  nodes |  fails |   iter |     nbCS | layers |   time |
|---+----+--------+--------+--------+----------+--------+--------|
| 1 |  1 | 375140 | 185287 | 375141 |  1116797 |     40 |  6.317 |
| 1 |  2 |   5150 |    292 |   5151 |  4264527 |     40 |  4.202 |
| 1 |  4 |   5220 |    327 |   5221 |  4506435 |     40 |   4.35 |
| 1 |  8 |   4868 |    151 |   4869 |  5723544 |     40 |  5.671 |
| 1 | 16 |   4734 |     84 |   4735 |  8362696 |     40 |  8.141 |
| 1 | 32 |   4658 |     46 |   4659 | 13527419 |     40 | 12.681 |
| 1 | 64 |   4614 |     24 |   4615 | 23262045 |     40 | 24.511 |
| 2 |  1 | 375140 | 185287 | 375141 |  1116797 |     40 |  5.866 |
| 2 |  2 |   5318 |    376 |   5319 |  4304833 |     40 |  4.171 |
| 2 |  4 |   5204 |    319 |   5205 |  4430911 |     40 |  3.812 |
| 2 |  8 |   4842 |    138 |   4843 |  5639406 |     40 |  5.485 |
| 2 | 16 |   4728 |     81 |   4729 |  8435389 |     40 |  7.887 |
| 2 | 32 |   4650 |     42 |   4651 | 13429027 |     40 | 13.624 |
| 2 | 64 |   4604 |     19 |   4605 | 22129139 |     40 | 21.681 |
| 3 |  1 | 375140 | 185287 | 565189 |  1347131 |     40 |  20.57 |
| 3 |  2 |   4926 |    180 |  10123 |  4818983 |     40 |  5.042 |
| 3 |  4 |   5292 |    363 |  10476 |  4914782 |     40 |  4.568 |
| 3 |  8 |   4848 |    141 |   9784 |  6636594 |     40 |  5.891 |
| 3 | 16 |   4730 |     82 |   9610 | 10191644 |     40 |  9.773 |
| 3 | 32 |   4658 |     46 |   9510 | 20556171 |     40 | 17.912 |
| 3 | 64 |   4608 |     21 |   9430 | 47743193 |     40 | 41.471 |

